const PICTURE_COUNT = 25;
const MIN_COUNT_LIKES = 15;
const MAX_COUNT_LIKES = 200;
const MIN_COUNT_COMMENTS_ID = 1;
const MAX_COUNT_COMMENTS_ID = 30;
const MIN_COUNT_AVATAR = 1;
const MAX_COUNT_AVATAR = 6;
const MIN_COUNT_MESSAGE = 1;
const MAX_COUNT_MESSAGE = 2;

const PHOTO_DESCRIPTION = ['Пляж не далеко от города', 'Указатель с надписью "GO TO THE BEACH"', 'Фото пляжа',
  'Девушка с фотоаппаратом на пляже', 'Суп с рисовыми фигурками', 'Машина на улице возле дома с откратыми дверями',
  'Дошечка с дольками клубники', 'Кружки с напитком и виноградом', 'Девушка на пляже смотрит на летящий самолет',
  'Обувь на подставке', 'Дорога с огороженной зулунью', 'Машина возле гаража', 'Вкусный салат', 'Кот в бутерброде',
  'столик с диваном', 'Небо с самолетом в далеке', 'Аркестр', 'Машина в каменном здании',
  'Девушкаины ноги подходят к шкафу', 'Отель с пальмами', 'на столе лежит тарелка с салатом и вилка', 'Закат на пляже',
  'Краб на камне' , 'Люди на концерте'];

const COMMENT_MESSAGE = ['Всё отлично!', 'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'];

const COMMENT_NAMES = ['Артём', 'Иван', 'Екатерина', 'Анна', 'Борис', 'Генадий', 'Вячеслав', 'Никита', 'Ольга', 'Олег',
  'Инакентий', 'Елена', 'Сватлана', 'Григорий'];

export {
  PICTURE_COUNT,
  MIN_COUNT_LIKES,
  MAX_COUNT_LIKES,
  MIN_COUNT_COMMENTS_ID,
  MAX_COUNT_COMMENTS_ID,
  MIN_COUNT_AVATAR,
  MAX_COUNT_AVATAR,
  MIN_COUNT_MESSAGE,
  MAX_COUNT_MESSAGE,
  PHOTO_DESCRIPTION,
  COMMENT_NAMES,
  COMMENT_MESSAGE,
};
